Revit 2024 API
GBXMLExportOptions Properties
The GBXMLExportOptions type exposes the following members.
Properties
Name | Description
Encoding
 The encoding options to go into the processing instruction for the exported gbXML file.
ExportAnalyticalSystems
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
ExportEnergyModelType
 The energy model type from which gbXML will be exported.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace